{"rule_id":"1","name":"Credential Dumping - GSecDump Execution","description":"Detects execution of GSecDump credential dumping tool. This is often used in credential access phase of ATP attacks.","risk_score":73,"severity":"high","type":"query","query":"event.code:\"1\" AND winlog.event_data.Image:(*gsecdump.exe OR *g64*.exe) AND winlog.event_data.User:(\"NT AUTHORITY\\\\SYSTEM\" OR SYSTEM)","language":"kuery","index":["winlogbeat-*"],"filters":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"},{"id":"T1003.002","name":"Security Account Manager","reference":"https://attack.mitre.org/techniques/T1003/002/"}]}],"enabled":true,"interval":"1m","from":"now-2m","author":["Security Operations"],"references":["https://www.truesec.com/hub/blog/gsecdump-a-tool-for-dumping-windows-credentials"],"tags":["Credential Access","T1003","GSecDump","Credential Dumping","Windows"]}
{"rule_id":"2","name":"Suspicious File Creation in Windows Temp - Credential Dumping Tool","description":"Detects suspicious executable file creation in Windows Temp directory by credential dumping tools. Indicates potential defense evasion.","risk_score":68,"severity":"high","type":"query","query":"event.code:\"11\" AND winlog.event_data.TargetFilename:(C\\:\\\\Windows\\\\Temp\\\\*.exe) AND winlog.event_data.Image:(*gsecdump.exe OR *secretsdump* OR *mimikatz* OR *procdump*)","language":"kuery","index":["winlogbeat-*"],"filters":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1564","name":"Hide Artifacts","reference":"https://attack.mitre.org/techniques/T1564/"},{"id":"T1027","name":"Obfuscated Files or Information","reference":"https://attack.mitre.org/techniques/T1027/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"}]}],"enabled":true,"interval":"1m","from":"now-2m","author":["Security Operations"],"references":["https://attack.mitre.org/techniques/T1564/"],"tags":["Defense Evasion","T1027","T1564","File Creation","Windows Temp","Credential Dumping"]}
{"rule_id":"3","name":"Privilege Escalation - Process Running as SYSTEM with Credential Tools","description":"Detects processes running with SYSTEM privileges executing credential dumping tools. Indicates privilege escalation and credential access.","risk_score":75,"severity":"high","type":"query","query":"event.code:\"1\" AND winlog.event_data.User:(\"NT AUTHORITY\\\\SYSTEM\") AND winlog.event_data.IntegrityLevel:(\"System\") AND winlog.event_data.Image:(*gsecdump* OR *mimikatz* OR *procdump* OR *secretsdump* OR *pwdump* OR *fgdump*)","language":"kuery","index":["winlogbeat-*"],"filters":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1068","name":"Exploitation for Privilege Escalation","reference":"https://attack.mitre.org/techniques/T1068/"},{"id":"T1134","name":"Access Token Manipulation","reference":"https://attack.mitre.org/techniques/T1134/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"}]}],"enabled":true,"interval":"1m","from":"now-2m","author":["Security Operations"],"references":["https://attack.mitre.org/tactics/TA0004/"],"tags":["Privilege Escalation","T1134","T1068","SYSTEM","Credential Tools"]}
{"rule_id":"4","name":"Lateral Movement Preparation - Credential Dumping Activity","description":"Detects credential dumping tools execution which often precedes lateral movement in ATP attacks.","risk_score":70,"severity":"high","type":"query","query":"event.code:(\"1\" OR \"11\") AND (winlog.event_data.Image:(*gsecdump* OR *mimikatz* OR *secretsdump* OR *lsass*) OR winlog.event_data.CommandLine:(*-a* OR *lsass* OR *sam* OR *security* OR *system*))","language":"kuery","index":["winlogbeat-*"],"filters":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0008","name":"Lateral Movement","reference":"https://attack.mitre.org/tactics/TA0008/"},"technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"},{"id":"T1003.001","name":"LSASS Memory","reference":"https://attack.mitre.org/techniques/T1003/001/"}]}],"enabled":true,"interval":"1m","from":"now-2m","author":["Security Operations"],"references":["https://attack.mitre.org/tactics/TA0008/"],"tags":["Lateral Movement","Credential Access","T1003","T1021","Preparation Phase"]}
{"rule_id":"5","name":"Execution - Suspicious Process Chain with Credential Tools","description":"Detects suspicious process execution chains involving credential dumping tools. Indicates execution phase of ATP attack.","risk_score":72,"severity":"high","type":"query","query":"event.code:\"1\" AND winlog.event_data.ParentImage:(*gsecdump.exe OR *cmd.exe OR *powershell.exe OR *wmic.exe) AND winlog.event_data.Image:(*gsecdump* OR *g64*.exe OR *mimikatz* OR *procdump*)","language":"kuery","index":["winlogbeat-*"],"filters":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/"},{"id":"T1059.001","name":"PowerShell","reference":"https://attack.mitre.org/techniques/T1059/001/"},{"id":"T1059.003","name":"Windows Command Shell","reference":"https://attack.mitre.org/techniques/T1059/003/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"}]}],"enabled":true,"interval":"1m","from":"now-2m","author":["Security Operations"],"references":["https://attack.mitre.org/tactics/TA0002/"],"tags":["Execution","T1059","Process Chain","Credential Dumping","Command Line"]}
{"rule_id":"6","name":"Persistence - Credential Tool in Program Files Directory","description":"Detects credential dumping tools installed in Program Files directory, indicating potential persistence mechanism.","risk_score":65,"severity":"medium","type":"query","query":"event.code:(\"1\" OR \"11\") AND winlog.event_data.Image:(\"C\\:\\\\Program Files\\\\*gsecdump*\" OR \"C\\:\\\\Program Files (x86)\\\\*gsecdump*\" OR \"C\\:\\\\Program Files\\\\*mimikatz*\" OR \"C\\:\\\\Program Files (x86)\\\\*mimikatz*\")","language":"kuery","index":["winlogbeat-*"],"filters":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"}]}],"enabled":true,"interval":"1m","from":"now-2m","author":["Security Operations"],"references":["https://attack.mitre.org/tactics/TA0003/"],"tags":["Persistence","T1547","Program Files","Installation","Credential Tools"]}
{"rule_id":"7","name":"Collection - Credential Dumping with Archive Indicators","description":"Detects credential dumping activity that may be part of collection phase before exfiltration.","risk_score":71,"severity":"high","type":"query","query":"event.code:\"1\" AND winlog.event_data.CommandLine:(*gsecdump* OR *mimikatz* OR *procdump*) AND winlog.event_data.CommandLine:(*-a* OR *sekurlsa* OR *logonpasswords* OR *dump*)","language":"kuery","index":["winlogbeat-*"],"filters":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0009","name":"Collection","reference":"https://attack.mitre.org/tactics/TA0009/"},"technique":[{"id":"T1005","name":"Data from Local System","reference":"https://attack.mitre.org/techniques/T1005/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"}]}],"enabled":true,"interval":"1m","from":"now-2m","author":["Security Operations"],"references":["https://attack.mitre.org/tactics/TA0009/"],"tags":["Collection","T1005","Credential Dumping","Data Collection","Pre-Exfiltration"]}
{"rule_id":"8","name":"Discovery - Credential Access Tool Reconnaissance","description":"Detects execution of credential tools which indicates reconnaissance and discovery of credential stores.","risk_score":60,"severity":"medium","type":"query","query":"event.code:\"1\" AND (winlog.event_data.Image:(*gsecdump* OR *mimikatz* OR *secretsdump*) OR winlog.event_data.TargetFilename:(*gsecdump* OR *mimikatz* OR *lsass*))","language":"kuery","index":["winlogbeat-*"],"filters":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087/"},{"id":"T1069","name":"Permission Groups Discovery","reference":"https://attack.mitre.org/techniques/T1069/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/"}]}],"enabled":true,"interval":"1m","from":"now-2m","author":["Security Operations"],"references":["https://attack.mitre.org/tactics/TA0007/"],"tags":["Discovery","T1087","T1069","Reconnaissance","Account Discovery"]}